УРВ_файловая/src/Catalogs/Сервисы/Сервисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сервисы</name>
  <attributes>
    <name>ВнешнийАдресМенеджераСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТарифы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяВитрина</name>
    <type>
      <types>CatalogRef.Витрины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяЛиния</name>
    <type>
      <types>CatalogRef.ЛинииПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомлятьПользователейОЗакрытииОбращений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьСлужбыПоддержкиПоУмолчанию</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>Внутренний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УчетныеЗаписиСлужбыПоддержки</name>
    <attributes>
      <name>УчетнаяЗапись</name>
      <type>
        <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/Catalogs/Сервисы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сервис по умолчанию, если в справочнике Сервисы присутствует только 1 элемент.
//
// Параметры:
//  Сервис - СправочникСсылка.Сервисы - исходное значение сервиса.
// 
// Возвращаемое значение:
//  СправочникСсылка.Сервисы - сервис по умолчанию.
//
Функция СервисПоУмолчанию(Сервис = Неопределено, ВнутреннийСервис = Ложь) Экспорт //Рарус kruser 24.04.2019 Параметр ВнутреннийСервис
    
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
        |	Сервисы.Ссылка КАК Сервис
        |ИЗ
        |	Справочник.Сервисы КАК Сервисы
        |ГДЕ
        |	НЕ Сервисы.ПометкаУдаления
		//{Рарус kruser 24.04.2019
		|	И Сервисы.Внутренний = &Внутренний
		|	И ОсновнойСервис"; 
		//}Рарус kruser 24.04.2019		
		
	//{Рарус kruser 24.04.2019
	Запрос.УстановитьПараметр("Внутренний", ВнутреннийСервис);
	//}Рарус kruser 24.04.2019
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Если Выборка.Количество() = 1 И Выборка.Следующий() Тогда
        Возврат Выборка.Сервис;
    Иначе
        Возврат ?(Не ЗначениеЗаполнено(Сервис), Справочники.Сервисы.ПустаяСсылка(), Сервис);
    КонецЕсли; 
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПервыеЛинииСервисов() Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    	"ВЫБРАТЬ
        |	Сервисы.Ссылка
        |ИЗ
        |	Справочник.Сервисы КАК Сервисы
        |ГДЕ
        |	Сервисы.ПерваяЛиния = ЗНАЧЕНИЕ(Справочник.ЛинииПоддержки.ПустаяСсылка)";
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    ПерваяЛиния = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ОбслуживающиеОрганизации.СлужбаПоддержки, "ПерваяЛинияПоддержки");
    
    Пока Выборка.Следующий() Цикл
        СервисОбъект = Выборка.Ссылка.ПолучитьОбъект();
        СервисОбъект.ПерваяЛиния = ПерваяЛиния;
        СервисОбъект.Записать();
    КонецЦикла;
	
КонецПроцедуры
 
#КонецОбласти 

#КонецЕсли
